In [3]:
import pandas as pd
s1 = pd.Series([-1.2,3.7,2.5,-8.2,6.3])

In [4]:
s1

0   -1.2
1    3.7
2    2.5
3   -8.2
4    6.3
dtype: float64

In [11]:
print(s1.index)
s1.values

RangeIndex(start=0, stop=5, step=1)

array([-1.2,  3.7,  2.5, -8.2,  6.3])

In [16]:
s2=pd.Series([1,2,3,4,5],index=[5,4,3,2,1])
s2

5    1
4    2
3    3
2    4
1    5
dtype: int64

In [19]:
s2.iloc[1]

2

In [24]:
s2.iloc[0:3]

5    1
4    2
3    3
dtype: int64

In [25]:
s2.loc[5:3]

5    1
4    2
3    3
dtype: int64

In [27]:
s3=pd.Series({"小李":1,"小陈":2,"小张":3,"小毛":4})
s3

小李    1
小陈    2
小张    3
小毛    4
dtype: int64

In [28]:
s3.loc["小李"]=11
s3

小李    11
小陈     2
小张     3
小毛     4
dtype: int64

In [31]:
s3[(s3>3)&(s3<10)]

小毛    4
dtype: int64

In [32]:
s3>5

小李     True
小陈    False
小张    False
小毛    False
dtype: bool

In [33]:
s3.mean

<bound method Series.mean of 小李    11
小陈     2
小张     3
小毛     4
dtype: int64>

In [34]:
s3.max()

11

In [35]:
s3.mean()

5.0

In [36]:
s3.describe()

count     4.000000
mean      5.000000
std       4.082483
min       2.000000
25%       2.750000
50%       3.500000
75%       5.750000
max      11.000000
dtype: float64

In [37]:
s3+2

小李    13
小陈     4
小张     5
小毛     6
dtype: int64

In [38]:
s3

小李    11
小陈     2
小张     3
小毛     4
dtype: int64

In [39]:
s3*9

小李    99
小陈    18
小张    27
小毛    36
dtype: int64

In [41]:
def get(score):
  if score>=90:
      return "A"
  elif score>=80:
      return "B"
  elif score>=70:
      return "C"
  else:
      return "D"

In [42]:
s3=s3*9
s3

小李    99
小陈    18
小张    27
小毛    36
dtype: int64

In [43]:
s3.loc["小毛"]=96

In [51]:
s4=s3.apply(get)

In [52]:
print(s3)
print(s4)

小李    99
小陈    18
小张    27
小毛    96
dtype: int64
小李    A
小陈    D
小张    D
小毛    A
dtype: object

In [69]:
s1=pd.Series(["001","002","003"],index=["张三","李四","王五"])
s2=pd.Series(["一班","二班","三班"],index=["张三","李四","王五"])
s3=pd.Series([99,98,97],index=["张三","李四","王五"])
s4=pd.DataFrame({"学号":s1,"班级":s2,"成绩":s3})
s4

     学号  班级  成绩
张三  001  一班  99
李四  002  二班  98
王五  003  三班  97

In [83]:
s5=pd.DataFrame({"张三":{"学号":"001","班级":"一班","成绩":99},"李四":{"学号":"002","班级":"二班","成绩":98},"王五":{"学号":"003","班级":"三班","成绩":97}})
s5.T

     学号  班级  成绩
张三  001  一班  99
李四  002  二班  98
王五  003  三班  97

In [85]:
s5

     张三   李四   王五
学号  001  002  003
班级   一班   二班   三班
成绩   99   98   97

In [89]:
s5=pd.DataFrame({"学号":{"张三":"001","李四":"002","王五":"003"},"班级":{"张三":"一班","李四":"二班","王五":"三班"},"成绩":{"张三":"98","李四":"97","王五":"96"}})
s5

     学号  班级  成绩
张三  001  一班  98
李四  002  二班  97
王五  003  三班  96

In [98]:
s5[["学号",'班级']]

     学号  班级
张三  001  一班
李四  002  二班
王五  003  三班

In [99]:
s5["学号"]

张三    001
李四    002
王五    003
Name: 学号, dtype: object

In [95]:
s5.iloc[1]

学号    002
班级     二班
成绩     97
Name: 李四, dtype: object

In [97]:
s5.loc['张三']

学号    001
班级     一班
成绩     98
Name: 张三, dtype: object

In [108]:
s5[(s5.成绩=="98")|(s5.学号=="003")]

     学号  班级  成绩
张三  001  一班  98
王五  003  一班  96

In [110]:
s5.head(10)

     学号  班级  成绩
张三  001  一班  98
李四  002  一班  97
王五  003  一班  96

In [118]:
name = pd.Series({"001":"小陈","002":"小李","003":"小王","004":"小张","005":"小赵","006":"小周"})
gender = pd.Series({"001":"女","002":"女","003":"男","004":"男","005":"女","006":"男"})
height = pd.Series({"001":172.5,"002":168.0,"003":178.2,"004":181.3,"005":161.7})
students = pd.DataFrame({"姓名":name,"性别":gender,"身高":height})
students

     姓名 性别     身高
001  小陈  女  172.5
002  小李  女  168.0
003  小王  男  178.2
004  小张  男  181.3
005  小赵  女  161.7
006  小周  男    NaN

In [121]:
print(students.index)
print(students.columns)

Index(['001', '002', '003', '004', '005', '006'], dtype='object')
Index(['姓名', '性别', '身高'], dtype='object')

In [128]:
students[["身高","性别"]]

        身高 性别
001  172.5  女
002  168.0  女
003  178.2  男
004  181.3  男
005  161.7  女
006    NaN  男

In [130]:
students.loc["003"]

姓名       小王
性别        男
身高    178.2
Name: 003, dtype: object

In [132]:
students.loc["003":"005"]

     姓名 性别     身高
003  小王  男  178.2
004  小张  男  181.3
005  小赵  女  161.7

In [136]:
students.loc["005","身高"]

161.7

In [143]:
students.loc[["003","005"],["姓名","身高"]]

     姓名     身高
003  小王  178.2
005  小赵  161.7

In [147]:
students.loc[["003","005"],["姓名","性别","身高"]]

     姓名 性别     身高
003  小王  男  178.2
005  小赵  女  161.7

In [158]:
students[(students["身高"] > 165) & (students["性别"] == "女")]

     姓名 性别     身高
001  小陈  女  172.5
002  小李  女  168.0

In [159]:
students[(students.身高 > 165) & (students.性别 == "女")]

     姓名 性别     身高
001  小陈  女  172.5
002  小李  女  168.0

In [160]:
students

     姓名 性别     身高
001  小陈  女  172.5
002  小李  女  168.0
003  小王  男  178.2
004  小张  男  181.3
005  小赵  女  161.7
006  小周  男    NaN

In [167]:
students["aa"]=[1,2,3,4,5,6]
students.loc["003"]=["大王","女",55,66]
students

     姓名 性别  身高  aa
001  小陈  女   1   1
002  小李  女   2   2
003  大王  女  55  66
004  小张  男   4   4
005  小赵  女   5   5
006  小周  男   6   6

In [175]:
students.drop("aa",axis=1)

     姓名 性别  身高
001  小陈  女   1
002  小李  女   2
003  大王  女  55
004  小张  男   4
005  小赵  女   5
006  小周  男   6

In [186]:
ss = pd.read_json("./JS.JSON")
ss

,questionType,asin,answerTime,unixTime,question,answerType,answer
0,yes/no,1466736038,"Mar 8,2014",1394265600,Is there a SIM card in it?,Y,"Yes, The Galaxy SIII accommodates a micro SIM ..."
1,yes/no,1466736038,"Mar 8,2014",1394265600,Is there a SIM card in it?,Y,"Yes, The Galaxy SIII accommodates a micro SIM ..."

In [187]:
ss.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   questionType  2 non-null      object
 1   asin          2 non-null      int64
 2   answerTime    2 non-null      object
 3   unixTime      2 non-null      int64
 4   question      2 non-null      object
 5   answerType    2 non-null      object
 6   answer        2 non-null      object
dtypes: int64(2), object(5)
memory usage: 244.0+ bytes

In [188]:
ss.describe()

               asin      unixTime
count  2.000000e+00  2.000000e+00
mean   1.466736e+09  1.394266e+09
std    0.000000e+00  0.000000e+00
min    1.466736e+09  1.394266e+09
25%    1.466736e+09  1.394266e+09
50%    1.466736e+09  1.394266e+09
75%    1.466736e+09  1.394266e+09
max    1.466736e+09  1.394266e+09

In [189]:
ss

,questionType,asin,answerTime,unixTime,question,answerType,answer
0,yes/no,1466736038,"Mar 8,2014",1394265600,Is there a SIM card in it?,Y,"Yes, The Galaxy SIII accommodates a micro SIM ..."
1,yes/no,1466736038,"Mar 8,2014",1394265600,Is there a SIM card in it?,Y,"Yes, The Galaxy SIII accommodates a micro SIM ..."

In [194]:
ss["questionType"].value_counts()

questionType
yes/no    2
Name: count, dtype: int64

ss

In [196]:
ss

,questionType,asin,answerTime,unixTime,question,answerType,answer
0,yes/no,1466736038,"Mar 8,2014",1394265600,Is there a SIM card in it?,Y,"Yes, The Galaxy SIII accommodates a micro SIM ..."
1,yes/no,1466736038,"Mar 8,2014",1394265600,Is there a SIM card in it?,Y,"Yes, The Galaxy SIII accommodates a micro SIM ..."

In [197]:
sss = ss
sss

,questionType,asin,answerTime,unixTime,question,answerType,answer
0,yes/no,1466736038,"Mar 8,2014",1394265600,Is there a SIM card in it?,Y,"Yes, The Galaxy SIII accommodates a micro SIM ..."
1,yes/no,1466736038,"Mar 8,2014",1394265600,Is there a SIM card in it?,Y,"Yes, The Galaxy SIII accommodates a micro SIM ..."